
# Parameters
nc: 64 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call cm_csp_11.yaml with scale 'n'
#  # [depth, width, max_channels]

  n: [0.50, 0.25, 1024] 
#   T: [0.67, 0.75, 768] 
#   B: [0.67, 1, 768] 

# YOLO11n backbone
backbone:
#  [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] #0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] #1-P2/4
  - [-1, 2, RDSBlock, [256,False]]
  - [-1, 1, ADown, [256]] # 3-P3/8
  - [-1, 2, CDSSMBlock, [512,False]]
  - [-1, 1, Conv, [512, 3, 2]] #5-P4/16
  - [-1, 2, RDSBlock, [512,True]]
  - [-1, 1, ADown, [1024]] # 7-P5/32
  - [-1, 2, RDSBlock, [1024,True]]
  - [-1, 1, SPPF, [1024, 5]] #9
#  - [-1, 2, C2PSA, [1024]] #10

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]#10
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, BVSSBlock, [ 512,128,8,False ]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2,  BVSSBlock, [ 256,64,8,False ]] # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 2, BVSSBlock, [ 512,128,8,True ]] # 18 (P4/16-medium)

  - [-1, 1, ADown, [512]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 2, BVSSBlock, [ 1024,256,8,True ]] # 21 (P5/32-large)

#  - [ 15, 1, CM_CSP_ELAN, [ 256,64,8 ] ]
#  - [ 18, 1,CM_CSP_ELAN, [ 512,128,8 ] ]
#  - [ 21, 1, CM_CSP_ELAN, [ 1024,256,8 ] ]

#  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
  # - [[19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5)
